# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "koekeishiya/formulae"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask "imageoptim" # a tool to optimize images
    cask "1password/tap/1password-cli"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-symbols-only-nerd-font"
    cask "font-recursive-code"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "alacritty" # a cross-platform, OpenGL terminal emulator;
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "entr" # file watcher / command runner
brew "eza" # ls alternative
brew "fd" # find alternative
brew "fnm" # Fast Node version manager
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grc" # colorize command's outputs
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "kubectx" # for better Kubernetes context and namespaces switch
brew "lazygit" # a better git UI
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "python" # python (latest)
brew "ripgrep" # very fast file searcher
brew "shellcheck" # diagnostics for shell sripts
brew "starship" # the shell prompt we are using
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zoxide" # switch between most used directories
